// Домашнее задание 3. Номер четверти плоскости
Console.Write("Введите номер четверти плоскости (1-4): ");
int quarter = int.Parse(Console.ReadLine());
while (quarter > 4 || quarter < 1)
{
    Console.Write("Вы ввели неверный номер четверти плоскости. Повторите попытку: ");
    quarter = int.Parse(Console.ReadLine());
}
if (quarter == 1)
{
    Console.Write("Диапазон возможных координат: Х - от -бесконечности до 0; Y - от -бесконечности до 0");
}
else if (quarter == 2)
{
    Console.Write("Диапазон возможных координат: Х - от -бесконечности до 0; Y - от 0 до +бесконечности");
}
else if (quarter == 3)
{
    Console.Write("Диапазон возможных координат: Х - от 0 до +бесконечности; Y - от 0 до +бесконечности");
}
else
    Console.Write("Диапазон возможных координат: Х - от 0 до +бесконечности; Y - от -бесконечности до 0");
